app/controllers/messages_controller.rb

  def create
    @message = Message.new(params.require(:messages).permit(:text))
    @message.save
---
INSERT INTO "messages" ("text", "url", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["text", "ads"], ["url", "http://privnote.herokuapp.com/"], ["created_at", "2017-11-03 13:03:51.622801"], ["updated_at", "2017-11-03 13:03:51.622801"]]

  def show
    id = params[:id]
    if Message.exists?(id)
      @message = Message.find(id)
      respond_to do |format|
        format.html # stays the same
        format.json { render json: @message.to_json }
        format.xml  { render :xml => @message.to_xml }
      end
      @message.destroy
    else
      # message is already destroyed
      @message = Message.new(:text => "The message was destroyed! You can't view it.")
      @message.save
---
SELECT  "messages".* FROM "messages" WHERE "messages"."id" = $1 LIMIT $2  [["id", 29], ["LIMIT", 1]]
DELETE FROM "messages" WHERE "messages"."id" = $1  [["id", 90]]
INSERT INTO "messages" ("text", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["text", "The message was destroyed! You can't view it."], ["created_at", "2017-11-05 18:12:02.739402"], ["updated_at", "2017-11-05 18:12:02.739402"]]

  def mssg_as_json
    if content_type?(/json/)
      text = params.permit(:message)[:message]
      @mssg = Mssg.create(:messages => text)
---
INSERT INTO "messages" ("text", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["text", "test"], ["created_at", "2017-11-03 15:22:11.659973"], ["updated_at", "2017-11-03 15:22:11.659973"]]

  def return_mssg_as_json
    # in browser
    if Message.exists?(params[:id])
      if @message == Message.find_by(id: params[:id])
---
SELECT  "messages".* FROM "messages" WHERE "messages"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]